[
  {
    "title": "J2EE FrontEnd Technologies",
    "authors": [
      "Lennart Jorelid"
    ],
    "publisher": "Apress",
    "publishedDate": "2001-12-07",
    "description": "J2EE FrontEnd Technologies: A Programmer's Guide to Servlets, JavaServer Pages, and Enterprise JavaBeans concisely and accurately describes what you need to know about effective enterprise development based on servlets, JSPs, and EJBs. Servlets, JSPs, and EJBs are the most important aspects of Java as it is used in the production of enterprise Web applications today. Lennart Jorelid's book concentrates on teaching programmers how to fit the various technologies together while spending as little time as possible on \"plumbing.\" Jorelid discusses servlet development and architecture, and he teaches developers how to integrate servlets into distributed enterprise systems with illustrated examples. He explains the architecture and implementation of JSPs—including introductory concepts such as using all built-in facilities of the JSP library and advanced topics such as creating your own custom actions using the JSP Tag Library API. Jorelid also addresses the open-source Struts framework from the Apache Software Foundation, which provides a powerful framework for J2EE Web application development by combining servlets and JSPs. And, finally, Jorelid explores the EJB programming paradigm, covering development and architecture of EJBs and J2EE integration and deployment. J2EE FrontEnd Technologies: A Programmer's Guide to Servlets, JavaServer Pages, and Enterprise JavaBeans provides developers with a unique approach to understanding the profound relationship between servlets, JSPs, and EJBs. Developers will gain a clear understanding of all three and will be able to harness this knowledge for their own real-world applications.",
    "pageCount": 1112,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=DYgRzBYTigQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Internationalization and Localization Using Microsoft .NET",
    "authors": [
      "Nick Symmonds"
    ],
    "publisher": "Apress",
    "publishedDate": "2002-01-29",
    "description": "Internationalization and Localization Using Microsoft .NET is intended to be a comprehensive discussion of how to localize code using Visual Studio .NET. Author Nick Symmonds knows the advantages of preparing for localization in the design stage and the disadvantages of localizing a project after the fact, and he discusses both methods of localizing code in this book. All aspects of localization are examined, from handling date, time, and currency and text data, to developing multilingual user interfaces and help files. He also covers Visual Studio's localization features and tools in depth and presents the pros and cons of each to the reader. Internationalization and Localization Using Microsoft .NET is unique in that it covers both C# and VB .NETall examples are presented in both languages. This language-independent approach is essential given that large systems may use both languages, and the principals discussed can be applied to other .NET languages as well. Some of the core topics covered are as follows: The Globalization and Resources namespaces, which relate directly to localization Resource files and how they are used in .NET Visual and command-line tools that aid in localization In depth discussion of design and implementation of world-ready programs Also included is a comprehensive example of a resource editor, with code provided in both C# and VB .NET. This project is not only useful as product in itself, but also instructive in how to write fairly complicated code in both .NET languages.",
    "pageCount": 352,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=ZvIWZaeQvUkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": ".NET Development for Java Programmers",
    "authors": [
      "Paul Gibbons"
    ],
    "publisher": "Apress",
    "publishedDate": "2002-07-31",
    "description": "Java developers have adapted to a world in which everything is an object, resources are reclaimed by a garbage collector, and multiple inheritance is replaced by interfaces. All of these things have prepared developers to thrive in Microsoft's new .NET environment using C#. Despite similarities between Java and C#, complex differences still lurk. This book will walk you through both language and library differences, to help you develop enterprise applications requiring mastery. You will then be able to build applications that communicate with databases and include network components, web pages, and many other features. Ordinarily, Java developers rely on Java 2 Enterprise Edition (J2EE) to provide these libraries, and C# developers rely on the .NET Framework. At first glance, there seems little similarity between the two, but author Paul Gibbons shows how a Java developer's J2EE skills transfer smoothly when tackling the .NET Framework. Early chapters highlight C#'s differences from Java, and discuss differences between the .NET CLR and JVM. Subsequent chapters cover various technologies in which J2EE development translates into .NET enterprise development. These middle chapters also explain .NET technologies that Java developers can begin using immediately. The final chapter examines migration of existing Java applications to C#, and the available tools and techniques. By the end of .NET Development for Java Programmers, a professional Java developer will be able to tackle a real software project in .NET, using C#.",
    "pageCount": 432,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=ZLBOHPDfCrYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": ".NET System Management Services",
    "authors": [
      "Alexander Golomshtok"
    ],
    "publisher": "Apress",
    "publishedDate": "2003-04-08",
    "description": "This detailed guide overviews the enterprise system management facilities, which are available as part of the Framework Class Library (FCL) of the .NET Framework. While Windows Management Instrumentation (WMI)a centerpiece of Microsoft's enterprise management technologyis a fairly well-researched topic, .NET system management documentation has, so far, been scarce. Therefore, this book aims to provide you with the comprehensive, sensible documentation that up until now has been lacking. The book will also cover overlooked aspects of .NET and WMI programming. After reading .NET System Management Services, you will possess solid understanding of the fundamental concepts behind WMI, and you will be able to quickly develop custom management tools which are often more flexible and powerful than any expensive, ready-made software.",
    "pageCount": 456,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=jvKExqzA5SkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Logging in Java with the JDK 1.4 Logging API and Apache log4j",
    "authors": [
      "Samudra Gupta"
    ],
    "publisher": "Apress",
    "publishedDate": "2003-04-15",
    "description": "Logging in Java with the JDK 1.4 Logging API and Apache log4j is the first book to discuss the two foremost logging APIs: JDK 1.4.0 logging API and Apache log4j 1.2.6 logging API for application developers. The internals of each API are examined, contrasted, and compared in exhaustive depth. Programmers will find a wealth of information simply not available elsewherenot even on the Internet. Each concept explained is accompanied by code example written in Java language. The book also provides guidelines for extending the existing logging frameworks to cater to application-specific needs. This is an essential handbook for logging-related information and techniques needed for developing applications in the Java language.",
    "pageCount": 336,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=86XagGYPzuoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Real World Software Configuration Management",
    "authors": [
      "Sean Kenefick"
    ],
    "publisher": "Apress",
    "publishedDate": "2003-11-11",
    "description": "Designed for use Visual Studio .NET/6.0, Visual SourceSafe 6.0c, and CVS 1.11, Real World Software Configuration Management provides an extensive overview on software configuration and development, accompanied by numerous real-world examples with lots of working code. While other books may spend a lot of time on software configuration management theory, Sean Kenefick focuses on practical solutions and processes that directly benefit developers in their day-to-day needs. What you’ll learnWho this book is for If youre a beginning to intermediate programmer whos had configuration management suddenly thrust upon you, this book is for you. Designed with the beginning programmers needs in mind, it gives extensive coverage of the basics before launching into more advanced topics. More experienced programmers will also find this book highly beneficial, howeverparticularly with regard to author Sean Keneficks excellent coverage of the more intricate points of Visual Studio, Visual SourceSafe, and CVS.",
    "pageCount": 464,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=7OXTH23YqeEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "J2ME Games with MIDP2",
    "authors": [
      "Carol Hamer"
    ],
    "publisher": "Apress",
    "publishedDate": "2004-06-04",
    "description": "Java 2 ME (Micro Edition) is the client-side Java development platform for building wireless Java-based cell phone and PDA applications. This book addresses the fun challenge of building game applications for these kinds of portable devices. Author Carol Hamer shows you how to use J2ME for developing, using the latest MIDP 2.0 specification. If you are new to developing with J2ME, we recommend you first read Jonathan Knudsen's Wireless Java: Developing with J2ME, Second Edition. We suggest that you read this book second, then complete the \"series\" with David Croft's Advanced Java Game Programming, for a comprehensive Apress experience of game developing with Java. Table of Contents Getting Started Using MIDlets Using the MIDP 2.0 Games API Using Threads and Tones Storing and Retrieving Data Communicating over a Network Securing Your Applications",
    "pageCount": 304,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=sJ59z38xomMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Decompiling Java",
    "authors": [
      "Godfrey Nolan"
    ],
    "publisher": "Apress",
    "publishedDate": "2004-07-30",
    "description": "Both Java and .NET use the idea of a \"virtual machine,\" or VM. And while VMs are useful for some purposes, they undermine the security of your source code, because creation can be reversed, or decompiled. Which makes this one-of-a-kind book extremely useful: you must understand decompilation, to properly protect your intellectual property. For example, how secure is your code after you run an obfuscator? The book will answer questions like this, and provide more thorough information about Java byte codes and the Java Virtual Machine (JVM) than any other book on the market. This book redresses the imbalance by providing insights into the features and limitations of today's decompilers and obfuscators, and offering a detailed look at what JVMs actually do. Table of Contents Introduction Ghost in the Machine Tools of the Trade Protecting Your Source: Strategies for Defeating Decompilers Decompiler Design Decompiler Implementation Case Studies",
    "pageCount": 280,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=6FDZ2Xqpi-4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Offshoring IT",
    "authors": [
      "Reverend Bill Blunden"
    ],
    "publisher": "Apress",
    "publishedDate": "2004-07-30",
    "description": "Reverend Bill Blunden tells all: who’s going offshore, who’s helping them do it, and why. In addition to presenting the pro-globalization stance of corporate America, Reverend Blunden gives voice to dissenting opinions that have largely been ignored by the media. This book offers an enlightening, detailed analysis of the offshore outsourcing phenomenon, and exposes the underlying core values of America’s economic and political system. Blunden has been directly affected by offshoring, and writes from the programmer's point of view—for the programmer. While Blunden is passionate about the topic, he and the editor ensure that this book presents both sides of the issue, and appeals to all readers. Table of Contents Setting the Stage Measuring the Trend The Offshoring Obstacle Course Arguments in Favor of Offshoring Arguments Against Offshoring",
    "pageCount": 152,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=v2YrV5KzEY4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "A Complete Guide to PivotTables",
    "authors": [
      "Paul Cornell"
    ],
    "publisher": "Apress",
    "publishedDate": "2004-11-05",
    "description": "PivotTables are powerful data analysis tools, yet most Excel users dont use them to their fullest potential. A Complete Guide to PivotTables: A Visual Approach shows you why PivotTables are so versatile for data analysis and how you can leverage PivotTables to rapidly spot trends and make fast business decisions on mountains of data. A series of step-by-step tutorials and plenty of sample business data will help you get productive with PivotTables quickly and easily. Whereas most books only devote a small section to PivotTables, this book covers everything about this important Excel feature. With his tremendous experience writing about Office and Excel for power users, Paul Cornell will teach you plenty about PivotTables.",
    "pageCount": 368,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=i3c_iatH2K4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Randal Schwartz's Perls of Wisdom",
    "authors": [
      "Randal Schwartz"
    ],
    "publisher": "Apress",
    "publishedDate": "2004-12-15",
    "description": "Randal Schwartz's Perls of Wisdom is a collection of more than 70 columns from popular and prolific Perl columnist Randal Schwartz. These insightful pieces cover everything from Perl basics to how to decompose XML using an HTML parser. Schwartzs unique writing style and (sometimes) truly twisted use of Perl makes for exciting reading for those who want to enhance their Perl skills. Table of Contents Advanced Perl Tutorials Text Searching and Editing HTML and XML Processing CGI Programming The Webmaster’s Toolkit",
    "pageCount": 350,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=FYvsVUVTOEYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Advanced SharePoint Services Solutions",
    "authors": [
      "Scot P. Hillier"
    ],
    "publisher": "Apress",
    "publishedDate": "2005-01-04",
    "description": "Whether or not youve already benefited from Scot P. Hillier's first renowned Apress book, Microsoft SharePoint: Building Office 2003 Solutions, this fantastic follow-up is sure to please! This book will cover advanced techniques for programming web parts and SharePoint Services. Hillier also covers advanced integration techniques with related products like BizTalk Server 2004 and Content Server. Intended for advanced developers who already know all of the basic SharePoint Services, this book will steer you in solving ultra-specific, advanced problems. Table of Contents Collaborative Application Markup Language Databases,Web Services, and Protocols Advanced Web Part Techniques Advanced SharePoint Portal Server Solutions The Information Bridge Framework The Business Scorecards Accelerator SharePoint and BizTalk Server 2004 SharePoint and Microsoft Content Management Server",
    "pageCount": 392,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=K67QPZIitmwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Practical Common Lisp",
    "authors": [
      "Peter Seibel"
    ],
    "publisher": "Apress",
    "publishedDate": "2005-04-07",
    "description": "Lisp is often thought of as an academic language, but it need not be. This is the first book that introduces Lisp as a language for the real world. Practical Common Lisp presents a thorough introduction to Common Lisp, providing you with an overall understanding of the language features and how they work. Over a third of the book is devoted to practical examples, such as the core of a spam filter and a web application for browsing MP3s and streaming them via the Shoutcast protocol to any standard MP3 client software (e.g., iTunes, XMMS, or WinAmp). In other \"practical\" chapters, author Peter Seibel demonstrates how to build a simple but flexible in-memory database, how to parse binary files, and how to build a unit test framework in 26 lines of code.",
    "pageCount": 528,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=-7Iha7ls1-8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Pro .NET 2.0 Code and Design Standards in C#",
    "authors": [
      "Mark Horner"
    ],
    "publisher": "Apress",
    "publishedDate": "2006-11-22",
    "description": "* Three sets of standards bundled in one book: Code standards, Design standards and patterns. Great value for the money! * Pro .NET Code & Design Standards in C# is based on industry best practices; it is intuitive and will be updated for every major edition of .NET. * It showcases the C# language. However, it is created in a universal style to make it suitable for all .NET development projects whatever flavor of language.",
    "pageCount": 360,
    "categories": [
      "Computers"
    ],
    "averageRating": 5.0,
    "ratingsCount": 1,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=u2HDVkvRIi4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": true,
    "saleInfoBuyLink": "https://play.google.com/store/books/details?id=u2HDVkvRIi4C&rdid=book-u2HDVkvRIi4C&rdot=1&source=gbs_api",
    "saleInfoListPriceAmount": 40.0,
    "saleInfoListPriceCurrencyCode": "USD"
  },
  {
    "title": "Pro PayPal E-Commerce",
    "authors": [
      "Damon Williams"
    ],
    "publisher": "Apress",
    "publishedDate": "2007-04-30",
    "description": "PayPal offers a wide range of payment technologies, but it’s not always clear which is the best choice for a website. This book gets under the hood to show you how the different technologies work, how to choose the right solution, and how to implement it - complete with real-world examples. The book shows developers how to integrate PayPal directly into websites to make use of its payment technologies. This allows developers, no matter what language they program in, to build shopping carts or similar channel products with PayPal as a payment option. The book is written by a PayPal employee with great knowledge of the technology.",
    "pageCount": 279,
    "categories": [
      "Computers"
    ],
    "averageRating": 3.0,
    "ratingsCount": 2,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=KKqi2deBsg8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": true,
    "saleInfoBuyLink": "https://play.google.com/store/books/details?id=KKqi2deBsg8C&rdid=book-KKqi2deBsg8C&rdot=1&source=gbs_api",
    "saleInfoListPriceAmount": 60.0,
    "saleInfoListPriceCurrencyCode": "USD"
  },
  {
    "title": "Practical Rails Plugins",
    "authors": [
      "Nick Plante",
      "David Berube"
    ],
    "publisher": "Apress",
    "publishedDate": "2008-08-01",
    "description": "The Rails framework empowers developers with unprecedented levels of productivity by embracing principles such as “convention over configuration” and “don’t repeat yourself”. This paradigm is even apparent at the community level, where developers regularly share their custom framework extensions by way of Rails’ plugins feature. Plugins offer a way for developers to extend the core Rails framework with their own custom features, allowing for rapid integration of features such as authentication, user ratings, and search. Practical Rails Plugins shows you how to capitalize upon the wide variety of plugins at your disposal by guiding you through their integration into a number of interesting projects. You’ll learn how to rapidly augment projects involving asynchronous video transcoding, geocoding and mapping, content management, community ratings, and PDF generation. You’ll also learn how to create and distribute your own plugins. The ultimate guide to building powerful web sites faster using Rails plugins Demonstrates how to use popular plugins within a number of practical (and fully functional) projects and mini–applications Shows you how to create and distribute your own plugins",
    "pageCount": 512,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=c1L4IzmUzicC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": true,
    "saleInfoBuyLink": "https://play.google.com/store/books/details?id=c1L4IzmUzicC&rdid=book-c1L4IzmUzicC&rdot=1&source=gbs_api",
    "saleInfoListPriceAmount": 40.0,
    "saleInfoListPriceCurrencyCode": "USD"
  },
  {
    "title": "Beginning Google Maps Mashups with Mapplets, KML, and GeoRSS",
    "authors": [
      "Sterling Udell"
    ],
    "publisher": "Apress",
    "publishedDate": "2008-11-21",
    "description": "Beginning Google Maps Mashups with Mapplets, KML, and GeoRSS is a beginner’s guide to creating web mashups using Google mapping technology. Serves as a single–source primer to displaying data on Google Maps Covers both Mapplets and the Google Maps API Provides everything you need to start participating in the geographic Web What you’ll learn “Mash up” GeoWeb services onto a Google map Package your mashup as a mapplet and publish it to maps.google.com Enhance your map with driving directions, local search, map advertising, and more Discover common Google–mapping mistakes to avoid Find out how and when to geocode existing data into mappable coordinates Deliver your own data as GeoXML Who this book is for This book is for web designers and developers who have not worked with Google Maps or geographic data before. A working knowledge of HTML is required, and some programming experience is beneficial.",
    "pageCount": 416,
    "categories": [
      "Computers"
    ],
    "averageRating": 1.0,
    "ratingsCount": 1,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=9p5_XOgeOMYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Linux Recipes for Oracle DBAs",
    "authors": [
      "Darl Kuhn",
      "Bernard Lopuz",
      "Charles Kim"
    ],
    "publisher": "Apress",
    "publishedDate": "2008-12-01",
    "description": "Linux Recipes for Oracle DBAs is an example–based book on managing Oracle Database in a Linux environment. Covering commonly used distributions such as Red Hat Enterprise Linux and Oracle Enterprise Linux, the book is written for database administrators who need to get work done and lack the luxury of curling up fireside with a stack of Linux documentation. The book is task–oriented: Look up the task to perform. See the solution. Read up on the details. Get the job done. Takes you directly from problem to solution Covers the “right” mix of Linux user and administration tasks for database administrators Respects your time by being succinct and to–the–point",
    "pageCount": 528,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=LeJkxH-nTdcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": true,
    "saleInfoBuyLink": "https://play.google.com/store/books/details?id=LeJkxH-nTdcC&rdid=book-LeJkxH-nTdcC&rdot=1&source=gbs_api",
    "saleInfoListPriceAmount": 50.0,
    "saleInfoListPriceCurrencyCode": "USD"
  },
  {
    "title": "Pro Ubuntu Server Administration",
    "authors": [
      "Sander van Vugt"
    ],
    "publisher": "Apress",
    "publishedDate": "2009-02-26",
    "description": "Pro Ubuntu Server Administration teaches you advanced Ubuntu system building. After reading this book, you will be able to manage anything from simple file servers to multiple virtual servers to high–availability clusters. This is the capstone volume of the Apress Ubuntu trilogy that includes Beginning Ubuntu Linux, Third Edition and Beginning Ubuntu Server LTS Administration: From Novice to Professional, Second Edition. You will be able to make Ubuntu technology shine in a Fortune 500 environment and let Ubuntu server become the backbone of your infrastructure. Topics covered include Performance monitoring and optimization High–availability clustering Advanced Lightweight Directory Access Protocol (LDAP) integrated networking",
    "pageCount": 424,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=0nUEyvqJdmQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": true,
    "saleInfoBuyLink": "https://play.google.com/store/books/details?id=0nUEyvqJdmQC&rdid=book-0nUEyvqJdmQC&rdot=1&source=gbs_api",
    "saleInfoListPriceAmount": 45.0,
    "saleInfoListPriceCurrencyCode": "USD"
  },
  {
    "title": "Comet and Reverse Ajax",
    "authors": [
      "Dennis McCarthy",
      "Chris Crane"
    ],
    "publisher": "Apress",
    "publishedDate": "2009-03-28",
    "description": "One of the most basic laws of a web application is that the client, not the server, must initiate any communication between the two. There are a number of common–use cases where, ideally, the server would like to talk to the client—dashboards and monitoring apps, chat rooms and other collaborations, and progress reports on long–running processes. Comet (a.k.a. Reverse Ajax) provides a mechanism for enabling this. Comet is moderately complex to implement. But this practical, hands–on book gets you going. In Part 1 of this book, we start by examining the use cases, and look at the simple alternatives to Comet and how far they can satisfy your needs. In some situations, though, only Comet will do. In Part 2, we demonstrate how to set up and run a Comet–based application. With this book, be a part of the next generation, Ajax 2.0.",
    "pageCount": 100,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=ZGPAoNP9p6UC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": true,
    "saleInfoBuyLink": "https://play.google.com/store/books/details?id=ZGPAoNP9p6UC&rdid=book-ZGPAoNP9p6UC&rdot=1&source=gbs_api",
    "saleInfoListPriceAmount": 25.0,
    "saleInfoListPriceCurrencyCode": "USD"
  },
  {
    "title": "Pro IronPython",
    "authors": [
      "Alan Harris"
    ],
    "publisher": "Apress",
    "publishedDate": "2009-06-22",
    "description": "IronPython represents a unique direction for developers interested in working with dynamic languages within the .NET Framework. Whether you’re looking to develop applications from scratch or add functionality and maintainability to an existing application, IronPython opens many doors while providing a high–speed, high–performance language that integrates tightly with other .NET languages. Learn to create applications using the benefits of a dynamically typed language. Discover how to leverage the power of IronPython to improve existing applications. Explore interacting with other .NET languages by invoking the common language runtime. Table of Contents Introduction to IronPython IronPython Syntax Advanced IronPython IronPython Studio Mixing and Mingling with the CLR Advanced Development Data Manipulation Caught in a Web IronPython Recipes",
    "pageCount": 312,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=izFShORshFQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Pro SQL Server 2008 Failover Clustering",
    "authors": [
      "Allan Hirt"
    ],
    "publisher": "Apress",
    "publishedDate": "2009-07-21",
    "description": "Pro SQL Server 2008 Failover Clustering is dedicated to the planning, implementation, and administration of clustered SQL Server 2008 implementations. Whether deploying a single–instance, two–node cluster or a multiple–node, many–instance cluster for consolidation, this book will detail all of the considerations and pitfalls that may be encountered along the way. Clustering and high–availability expert Allan Hirt shares his many years of wisdom and experience, showing how to put together the right combination of people, processes, technology, and best practices to create and manage world–class, highly available SQL Server 2008 failover clusters. Provides a comprehensive look at SQL Server 2008 failover clustering from the first steps of planning to daily administration Goes beyond just SQL Server 2008 and also covers Windows Server 2008 clustering in depth with a SQL Server focus Covers how and where virtualization can be used with failover clusters Addresses the needs of enterprise–class, 24/7 SQL Server 2008 implementations Written by the leading expert on SQL Server failover clustering What you’ll learn Understand what failover clustering is, how it works, and how it can benefit SQL Server deployments. Configure disk subsystems to support failover clustering implementations. Plan, implement, and administer Windows Server 2008 clustering for use with SQL Server 2008. Plan, implement, and administer new SQL Server 2008 failover clustering instances. Upgrade existing SQL Server 2000 and SQL Server 2005 failover clustering instances to SQL Server 2008. Create virtualized clusters for use in test and development environments. Who this book is for This book is for IT administrators and database administrators who are faced with implementing and administering clustered SQL Server 2008 instances. This book is also for those who will be upgrading existing SQL Server 2000 or SQL Server 2005 failover clustering instances to SQL Server 2008. Table of Contents Failover Clustering Basics Preparing to Cluster Windows Clustering Windows Server 2008 Part 1: Preparing Windows Clustering Windows Server 2008 Part 2: Clustering Windows Preparing to Cluster SQL Server 2008 Installing a New SQL Server 2008 Failover Clustering Instance Upgrading to SQL Server 2008 Failover Clustering Administering a SQL Server 2008 Failover Cluster Virtualization and Failover Clustering",
    "pageCount": 424,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=rZocIajz8MYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Pro (IBM) WebSphere Application Server 7 Internals",
    "authors": [
      "Colin Renouf"
    ],
    "publisher": "Apress",
    "publishedDate": "2009-08-29",
    "description": "Pro (IBM) WebSphere Application Server 7 Internals covers the internal architecture and implementation of the WebSphere Application Server (WAS) version 7 product set and how other IBM products extend it. It presents information to enable administrators, developers, and architects to learn about the aspects of WAS that apply to them: Administrators will come to understand how the WAS7 environment functions to best optimize it for their environment, and what to do when things go wrong. Developers will learn to extend the functionality in the base WAS product. Architects will see how the WAS product underpins the IBM offerings to fit in an enterprise.",
    "pageCount": 392,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=5IItqtLReMEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": true,
    "saleInfoBuyLink": "https://play.google.com/store/books/details?id=5IItqtLReMEC&rdid=book-5IItqtLReMEC&rdot=1&source=gbs_api",
    "saleInfoListPriceAmount": 75.0,
    "saleInfoListPriceCurrencyCode": "USD"
  },
  {
    "title": "Pro Bash Programming",
    "authors": [
      "Chris Johnson"
    ],
    "publisher": "Apress",
    "publishedDate": "2009-12-05",
    "description": "The bash shell is a complete programming language, not merely a glue to combine external Linux commands. By taking full advantage of shell internals, shell programs can perform as snappily as utilities written in C or other compiled languages. And you will see how, without assuming Unix lore, you can write professional bash 4.0 programs through standard programming techniques. Complete bash coverage Teaches bash as a programming language Helps you master bash 4.0 features",
    "pageCount": 350,
    "categories": [
      "Computers"
    ],
    "averageRating": 5.0,
    "ratingsCount": 1,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=NJmhi6T0nGMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": true,
    "saleInfoBuyLink": "https://play.google.com/store/books/details?id=NJmhi6T0nGMC&rdid=book-NJmhi6T0nGMC&rdot=1&source=gbs_api",
    "saleInfoListPriceAmount": 35.0,
    "saleInfoListPriceCurrencyCode": "USD"
  },
  {
    "title": "The Definitive Guide to PC-BSD",
    "authors": [
      "Dru Lavigne"
    ],
    "publisher": "Apress",
    "publishedDate": "2010-03-22",
    "description": "This book is the ultimate reference for both beginners and power users to PC-BSD—the free, easy-to-use operating system based on FreeBSD. Existing power users will learn how to look under the hood and contribute to the global PC-BSD community. PC-BSD is turning into a hassle-free alternative to Linux on the desktop. Enjoy secure, virus-free computing Quickly become a power user What you’ll learn How to completely customize your desktop to suit your personality and quickly access your favorite applications How to find and install quality, no-cost software How to keep your system secure, virus-free, and up to date How to perform common tasks such as playing music and video, sharing files, and gaming How to integrate the PC-BSD desktop into your network How to become part of the PC-BSD community Who this book is for You don’t have to be a Unix user to enjoy the PC-BSD operating system. Even if you’re fairly new to computers, this book will quickly get you started using and enjoying PC-BSD. Existing power users will discover new usage tricks and learn how to advance their PC-BSD skills. Table of Contents Introducing PC-BSD Installing PC-BSD Customizing the Desktop Getting Around Performing Common Tasks User System Settings Administrative System Settings Push Button Installer System FreeBSD Packages FreeBSD Ports Getting Help Getting Involved Advanced Tasks Becoming a Developer",
    "pageCount": 400,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=GE089jRaR88C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Building iPhone OS Accessories",
    "authors": [
      "Ken Maskrey"
    ],
    "publisher": "Apress",
    "publishedDate": "2010-06-07",
    "description": "This book provides a serious, in-depth look at Apple’s External Accessory framework and the iPhone Accessories API. You’ll learn how to create new, integrated solutions that combine iPhone apps with dedicated hardware. The iPhone OS Accessories API expands the opportunities for innovative iPhone developers, allowing you to control and monitor external devices, whether you’ve built them yourself or obtained them from a third party. What you’ll learn Develop accessories and apps for the iPhone and iPod touch. Use Apple’s External Accessory framework to create hardware/software interaction. Control and monitor external devices using the iPhone Accessories API. Use the specific controller classes within the iPhone OS software development kit. Build and control your own accessory. Get your accessories approved by Apple’s AE program. Who this book is for This book is for iPhone and iPod touch developers who want to write apps to control external accessories and hardware developers who want to create accessories for iPhone and iPod touch. This includes embedded systems programmers who have been left out of the iPhone gold rush until now. The iPhone OS Accessories API expands the market of iPhone developers yet again, and this book is for all those developers wanting to use these new APIs to control and monitor external device—whether self-built or acquired from other sources. Table of Contents Accessory Overview EAAccessory Framework EA Framework Design Patterns The Game Controller Specifying a Pong Game Coding a Pong Game Adding the Game Controller Improving the Design Apple Developer Programs Hardware Design Firmware Everything Else",
    "pageCount": 328,
    "categories": [
      "Computers"
    ],
    "averageRating": 5.0,
    "ratingsCount": 1,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=VPL5uvbQ_nEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Beginning Django E-Commerce",
    "authors": [
      "James McGaw"
    ],
    "publisher": "Apress",
    "publishedDate": "2010-06-21",
    "description": "Beginning Django E-Commerce guides you through producing an e-commerce site using Django, the most popular Python web development framework. Topics covered include how to make a shopping cart, a checkout, and a payment processor; how to make the most of Ajax; and search engine optimization best practices. Throughout the book, you'll take each topic and apply it to build a single example site, and all the while you'll learn the theory behind what you're architecting. Build a fully functional e-commerce site. Learn to architect your site properly to survive in an increasingly competitive online landscape with good search engine optimization techniques. Become versed in the Django web framework and learn how you can put it to use to drastically reduce the amount of work you need to do to get a site up and running quickly.",
    "pageCount": 300,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=LwO1GzMN_QsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": true,
    "saleInfoBuyLink": "https://play.google.com/store/books/details?id=LwO1GzMN_QsC&rdid=book-LwO1GzMN_QsC&rdot=1&source=gbs_api",
    "saleInfoListPriceAmount": 50.0,
    "saleInfoListPriceCurrencyCode": "USD"
  },
  {
    "title": "Pro ASP.NET 4 in C# 2010",
    "authors": [
      "Matthew MacDonald",
      "Adam Freeman"
    ],
    "publisher": "Apress",
    "publishedDate": "2010-06-30",
    "description": "ASP.NET 4 is the principal standard for creating dynamic web pages on the Windows platform. Pro ASP.NET 4 in C# 2010 raises the bar for high-quality, practical advice on learning and deploying Microsoft's dynamic web solution. This edition is updated with everything you need to master up to version 4 of ASP.NET, including coverage of ASP.NET MVC, ASP.NET AJAX 4, ASP.NET Dynamic Data, and Silverlight 3. Seasoned .NET professionals Matthew MacDonald and Mario Szpuszta explain how you can get the most from these groundbreaking technologies. They cover ASP.NET 4 as a whole, illustrating both the newer features and the functionality carried over from previous versions of ASP. This book will give you the knowledge you need to code real ASP.NET 4 applications in the best possible style. Table of Contents Introducing ASP.NET Visual Studio Web Forms Server Controls ASP.NET Applications State Management ADO.NET Fundamentals Data Components and the DataSet Data Binding Rich Data Controls Caching and Asynchronous Pages Files and Streams LINQ XML User Controls Themes and Master Pages Website Navigation Website Deployment The ASP.NET Security Model Forms Authentication Membership Windows Authentication Authorization and Roles Profiles Cryptography Custom Membership Providers Custom Server Controls Graphics, GDI+, and Charting JavaScript and Ajax Techniques ASP.NET AJAX Portals with Web Part Pages MVC Dynamic Data Silverlight",
    "pageCount": 1616,
    "categories": [
      "Computers"
    ],
    "averageRating": 4.5,
    "ratingsCount": 4,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=2wg5LCKuChcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Pro Telerik ASP.NET and Silverlight Controls",
    "authors": [
      "Jose Rolando Guay Paz"
    ],
    "publisher": "Apress",
    "publishedDate": "2010-07-07",
    "description": "This book provides a complete guide to implementing Telerik’s range of ASP.NET and Silverlight controls. Telerik controls are invaluable for ASP.NET and Silverlight developers because they provide a vast array of rich controls targeted for the presentation layer of web applications. Telerik offers you solutions for the reports, grids, charts, and text-editing controls that you need but don’t want to build from scratch yourself—the options are endless for increasing the functionality of any of your web solutions. What you’ll learn Understand how to integrate the standard Telerik controls into any ASP.NET or Silverlight solution to increase productivity and usability. Incorporate the Telerik extensions for ASP.NET MVC. Learn to implement Telerik Open Access and ORM for all your data access requirements. Understand the new functionality provided by the WebAii Testing Framework. Work with the full API to master using the entire suite of controls. Who this book is for This book is aimed at .NET developers working with ASP.NET and Silverlight who want to take advantage of the prewritten controls that Telerik provides when developing their software. No prior knowledge of Telerik controls is required, but a working knowledge of ASP.NET and Silverlight is assumed. Table of Contents Introducing ASP.NET and Telerik Getting Started With Telerik RadControls Input RadControls Navigation RadControls Date, Time, and Scheduling RadControls Data RadControls, Part 1 Data RadControls, Part Layout RadControls Chart and Image RadControls Additional RadControls RadAjax Telerik Extensions for ASP.NET MVC RadControls for Silverlight Introducing Telerik Reporting Telerik OpenAccess ORM",
    "pageCount": 696,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=UL3i6G8rZ3MC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Beginning Google Maps API 3",
    "authors": [
      "Gabriel Svennerberg"
    ],
    "publisher": "Apress",
    "publishedDate": "2010-07-27",
    "description": "This book is about the next generation of the Google Maps API. It will provide the reader with the skills and knowledge necessary to incorporate Google Maps version 3 on web pages in both desktop and mobile browsers. It also describes how to deal with common problems that most map developers encounter at some point, like performance and usability issues with having too many markers and possible solutions to that. Introduction to the Google Maps API version 3 Solutions to common problems most developers encounters (too many markers, common JavaScript pitfalls) Best practices using HTML/CSS/JavaScript and Google Maps What you’ll learn Building reliable Google Maps web applications How to transfer from version 2 to version 3 of the API Best practices using HTML/CSS/JavaScript Dealing with large amounts of map markers How to look up addresses and coordinates using GeoCoding and reversed GeoCoding Who this book is for Web designers/web developers with a basic knowledge of HTML, CSS and JavaScript, as well as people with knowledge of the old Google Maps API that needs help to easily transfer to the new API. And, this book is for anyone interested in learning how to integrate Google Maps on their web page. Table of Contents Introducing the Google Maps API Transferring from Version 2 to 3 Creating Your First Map Taking the Map Further with MapOptions X Marks the Spot Marker Icons InfoWindow Tips and Tricks Creating Polylines and Polygons Dealing with Massive Numbers of Markers Location, Location, Location",
    "pageCount": 328,
    "categories": [
      "Computers"
    ],
    "averageRating": 5.0,
    "ratingsCount": 1,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=gHb8m0GSV2MC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Introducing Visual C# 2010",
    "authors": [
      "Adam Freeman"
    ],
    "publisher": "Apress",
    "publishedDate": "2010-11-24",
    "description": "If you’re new to C# programming, this book is the ideal way to get started. Respected author Adam Freeman guides you through the C# language by carefully building up your knowledge from fundamental concepts to advanced features. The book gradually builds up your knowledge, using the concepts you have already grasped to support those that come next. You will explore all the core areas of the C# language and the .NET Framework on which it runs. Particular attention is paid to the creation of Web and Windows applications and data access—danger zones where novice programmers often go awry in their early coding attempts. Introducing Visual C# 2010 is a comprehensive primer. Even if you have no previous programming experience, you can have confidence in the fact that you'll be able to build well constructed web and Windows applications of your own once you have finished reading this book. What you’ll learn Understand the fundamentals of the C# language’s syntax and grammar and use it to create Web and Windows applications. What object oriented programming is and how it is used in the .NET 4 Framework to save you time and increase the language’s flexibility. Connect to a wide range of data sources and incorporate their information into your dynamic applications. Understand the key time and effort saving features of C# such as generics, lambda expressions, and delegates. Discover the huge array of supporting technologies that .NET 4 provides such as the Windows Presentation Foundation, LINQ, Parallel Programming, ASP.NET, Silverlight and Web Services. Who this book is for This book is ideal for anyone who is interested in learning about Microsoft's Visual C# 2010 language. Whether you have no previous coding experience or are bringing some existing skills with you from another programming language, this book will teach you everything you need to know to confidently create your own C# programs. Table of Contents Getting Started with SQL Azure Design Considerations Setting Up and Configuring Security Data Migration and Backup Strategies Programming with SQL Azure OData with SQL Azure Reporting Services with SQL Azure Windows Azure and ASP.NET Designing for High Performance SQL Azure Data Sync Services Performance Tuning Houston SQL Azure Quick Reference",
    "pageCount": 1320,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=yYurBib49W8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Beginning Google Sketchup for 3D Printing",
    "authors": [
      "Sandeep Singh"
    ],
    "publisher": "Apress",
    "publishedDate": "2010-12-09",
    "description": "The age of 3D printing and personal fabrication is upon us! You’ve probably heard of the incredibly sophisticated, yet inexpensive 3D printers that can produce almost any creation you give them. But how do you become part of that revolution? Sandeep Singh takes you through the skills you need to learn and the services and technologies you need to know—explaining what 3D printing is, how it works, and what it can do for you. You’ll find yourself rapidly prototyping and learning to produce complex designs that can be fabricated by online 3D printing services or privately-owned 3D printers—in your hands in no time. Beginning Google SketchUp for 3D Printing starts by explaining how to use SketchUp and its plug-ins to make your design products. You will learn how to present and animate 3D models, and how to use Google Earth and 3D Warehouse to sell and market your 3D models. You'll also catch a glimpse of the 3D printing's future so you can plan ahead while mastering today's tools. Beginning Google SketchUp for 3D Printing is the perfect book for 3D designers, hobbyists, woodworkers, craftspeople, and artists interested in the following: Designing in 3D using SketchUp Using the online 3D printing pipeline Animating SketchUp 3D models Becoming familiar with rapid prototyping technology Navigating new 3D and personal fabrication technologies Working with Google Earth and 3D Warehouse with confidence Welcome to the era of 3D printing and personal fabrication! What you’ll learn 3D design for beginners Using Sketchup Using the online 3D printing pipeline Animating Sketchup 3D models Becoming familiar with rapid prototyping technology Navigating new 3D and personal fabrication technologies Negotiating Google Earth and 3D Warehouse with confidence Who this book is for 3D designers, hobbyists, woodworkers, craftspeople and artists. Table of Contents The Ins and Outs of Google SketchUp and Shapeways First 3D Printout Getting Your Juices Flowing 3D Model to 3D Print Tools and Techniques to Save Time Breaking the Barrier Modeling with Photographs Working with Symmetry Share with the World Animate with SketchyPhysics Using LayOut Exploring 3D Printing Alternatives Get Connected",
    "pageCount": 328,
    "categories": [
      "Computers"
    ],
    "averageRating": 5.0,
    "ratingsCount": 1,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=yIZsd5vVZtYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Pro WPF and Silverlight MVVM",
    "authors": [
      "Gary Hall"
    ],
    "publisher": "Apress",
    "publishedDate": "2010-12-29",
    "description": "WPF and Silverlight are unlike any other user interface (UI) technologies. They have been built to a new paradigm that—if harnessed correctly—can yield unprecedented power and performance. This book shows you how to control that power to produce clean, testable, maintainable code. It is now recognized that any non-trivial WPF or Silverlight application needs be designed around the Model-View-ViewModel (MVVM) design pattern in order to unlock the technology's full data-binding potential. However, the knowledge of how to do this is missing from a large part of the development community—even amongst those who work with WPF and Silverlight on a daily basis. Too often there is a reliance on programmatic interaction between controls and not enough trust in the technologies' data-binding capabilities. This leads to a clouding of design values and an inevitable loss of performance, scalability, and maintainability throughout the application. Pro WPF and Silverlight MVVM will show you how to arrange your application so that it can grow as much as required in any direction without danger of collapse. What you’ll learn Understand why the separation of an application’s View and its Model is paramount, including the history of Model-View-Presenter and Model-View-Controller. Apply WPF and Silverlight’s powerful data-binding model correctly. Examine how to organize an application targeting WPF or Silverlight, including unit-testing, source-control, separation of concerns, data serialization, and how to tie everything together with MVVM. Develop a full game development application using MVVM by example. How to serialize the Model without being invasive, how to implement a plug-in architecture that extends both the View and the Model, and how to handle Exceptions gracefully. Who this book is for Developers that wish to learn how to architect WPF or Silverlight applications to ensure maintainability, testability, and separation of concerns. Table of Contents Overview of WPF and Silverlight DataBinding Model-View Separation The ViewModel Events and Commands Validation Unit Testing Data Access Layer Application Support Sample Application",
    "pageCount": 272,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=1uCNKNW0Zj4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Beginning Oracle SQL",
    "authors": [
      "Lex deHaan",
      "Karen Morton",
      "Tim Gorman",
      "Inger Jorgensen",
      "Daniel Fink",
      "Andrew Morton"
    ],
    "publisher": "Apress",
    "publishedDate": "2011-01-28",
    "description": "Beginning Oracle SQL is your introduction to the interactive query tools and specific dialect of SQL used with Oracle Database. The book is a revision of the classic Mastering Oracle SQL and SQL*Plus by Lex de Haan, and has been updated to cover developments in Oracle's version of the SQL query language. Written in an easygoing and example-based style, Beginning Oracle SQL is the book that will get you started down the path to successfully writing SQL statements and getting results from Oracle database. Takes an example-based approach, with clear and authoritative explanations Introduces both SQL and the query tools used to execute SQL statements Shows how to create tables, populate them with data, and then query that data to generate business results",
    "pageCount": 459,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=6KlQvJQbmh8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": true,
    "saleInfoBuyLink": "https://play.google.com/store/books/details?id=6KlQvJQbmh8C&rdid=book-6KlQvJQbmh8C&rdot=1&source=gbs_api",
    "saleInfoListPriceAmount": 45.0,
    "saleInfoListPriceCurrencyCode": "USD"
  },
  {
    "title": "Beginning Arduino Programming",
    "authors": [
      "Brian Evans"
    ],
    "publisher": "Apress",
    "publishedDate": "2011-12-17",
    "description": "Beginning Arduino Programming allows you to quickly and intuitively develop your programming skills through sketching in code. This clear introduction provides you with an understanding of the basic framework for developing Arduino code, including the structure, syntax, functions, and libraries needed to create future projects. You will also learn how to program your Arduino interface board to sense the physical world, to control light, movement, and sound, and to create objects with interesting behavior. With Beginning Arduino Programming, you'll get the knowledge you need to master the fundamental aspects of writing code on the Arduino platform, even if you have never before written code. It will have you ready to take the next step: to explore new project ideas, new kinds of hardware, contribute back to the open source community, and even take on more programming languages.",
    "pageCount": 272,
    "categories": [
      "Computers"
    ],
    "averageRating": 5.0,
    "ratingsCount": 1,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=bbmqPpPyvUEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": true,
    "saleInfoBuyLink": "https://play.google.com/store/books/details?id=bbmqPpPyvUEC&rdid=book-bbmqPpPyvUEC&rdot=1&source=gbs_api",
    "saleInfoListPriceAmount": 40.0,
    "saleInfoListPriceCurrencyCode": "USD"
  },
  {
    "title": "Advanced Android 4 Games",
    "authors": [
      "Vladimir Silva"
    ],
    "publisher": "Apress",
    "publishedDate": "2011-12-20",
    "description": "\"Wolfenstein 3D\"-like and \"Doom\"-like game apps are some of the classic Android games presented in the original edition of this book. Since their release, Android has progressed with the debut of Android 4.0, adding better fonts, new User Interface and Experience (UI/UX) APIs, tablet considerations, multi-touch capabilities, multi-tasking, faster performance, and much more to the Android game app development repertoire. Multi-touch code gives these games and their players dynamic input and exchange ability, for a more realistic arcade game experience. Faster and better performance offers game players a more seamless, fun arcade experience like never before on Android. There is also improved native C/C++ integration with Android's NDK as well, which makes coding, compiling, and converting both productive and efficient with gains in app performance. With actionable real-world source, Advanced Android 4 Games shows you how to build more sophisticated and addictive Android games, harnessing the power of these recent advancements. Coverage of the new UI, UX, multi-touch and multi-tasking features available with Android 4.0. Learn other techniques for improving the game playing experience including Wi-Fi tethering, better multi-tasking, new and better streaming Web video using WebM, and more. By combining the elegant object-oriented features of Java and the raw power of C, there is no limit to the types of games that you can build for the platform, such as the \"Quake 3D\"-like game app case study in this book. You’ll definitely have fun, and perhaps you’ll even make some money. Enjoy! What you’ll learn Key advanced Android gaming techniques using the new Android SDK 4 to help you earn more money in the app stores How to compile native code (C) in Android using the NDK How to add and integrate multi-touch How to use Bluetooth controllers (Zeemote) More gaming tricks and tips, such as hybrid 3D graphics with OpenGL and JNI How to port and augment a 2D shooter game app similar to \"Wolfenstein\" for Android How to port and augment another 2D shooter \"Doom\"-like game app for Android using OpenGL How to build a 3D shooter game like \"Quake\" How and where to best deploy these game apps Who this book is for This book is for savvy Android app developers who are looking for professional or advanced techniques for porting, augmenting and building 2D and 3D game apps that are complex, fun and lucrative. Table of Contents Welcome to Android Gaming Gaming Tricks: More Gaming Tricks: Hybrid 3D Graphics with OpenGL and JNI Efficient Graphics with OpenGL ES 2.0 2D Shooters with OpenGL: Doom-like App for Android 3D Shooters Part I: Quake-like App 3D Shooters Part II: Quake II Appendix: Deployment and Compilation Tips",
    "pageCount": 300,
    "categories": [
      "Computers"
    ],
    "averageRating": 4.0,
    "ratingsCount": 3,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=jZSiAd_sUaoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Beginning Kinect Programming with the Microsoft Kinect SDK",
    "authors": [
      "Jarrett Webb",
      "James Ashley"
    ],
    "publisher": "Apress",
    "publishedDate": "2012-02-23",
    "description": "Beginning Kinect Programming with the Microsoft Kinect SDK gets you up and running developing Kinect applications for your PC using Microsoft tools and the official SDK. You will have a working Kinect program by the end of the first chapter! The following chapters will open up the secrets of three-dimensional vision, skeleton tracking, audio through the Kinect, and more. Examples illustrate the concepts in the form of simple games that react to your body movements. The result is a fun read that helps you learn one of the hottest technologies out there today. Beginning Kinect Programming with the Microsoft Kinect SDK also provides building blocks and ideas for mashing up the Kinect with other technologies to create art, interactive games, 3D models and enhanced office automation. You'll learn the fundamental code basic to almost all Kinect applications. You'll learn to integrate that code with other tools and manipulate data to create amazing Kinect applications. Beginning Kinect Programming with the Microsoft Kinect SDK is your gateway into the exciting world of three-dimensional, real-time computer interaction. Helps you create a proper development environment for Kinect applications. Covers the basics of three-dimensional vision, skeleton tracking, gesture recognition, and audio Provides fun examples that keep you engaged and learning What you’ll learn Create a proper development environment Work with data streams from the Kinect sensor Use skeleton-tracking for interactive applications Build speech-aware applications Develop simple, Kinect-based games for the PC Learn the underlying math involved in three-dimensional programming Who this book is for Beginning Kinect Programming with the Microsoft Kinect SDK is for Microsoft developers who want to learn to program for the newest and coolest Microsoft input device. The book assumes familiarity, but not expertise, with WPF and C#. Developers will be able to use their current knowledge and experience with the Microsoft stack to build new types of applications that have never been possible before. Most of all, this book is for developers who want to go beyond simply creating data-entry applications and recapture the fun of creating software. Table of Contents Getting Started with Kinect Application Fundamentals Depth Image Processing Kinect Skeletons Advanced Skeleton Tracking Kinect Gestures Speech Beyond the Basics",
    "pageCount": 324,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=MupB_VAmtdEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Beginning ASP.NET 4.5 in C#",
    "authors": [
      "Matthew MacDonald"
    ],
    "publisher": "Apress",
    "publishedDate": "2012-10-24",
    "description": "This book is the most comprehensive and up to date introduction to ASP.NET ever written. Focussing solely on C#, with no code samples duplicated in other languages, award winning author Matthew MacDonald introduces you to the very latest thinking and best practices for the ASP.NET 4.5 technology. Assuming no prior coding experience, you'll be taught everything you need to know from the ground up. Starting from first principals, you'll learn the skills you need to be an effective ASP.NET developer who is ready to progress to more sophisticated projects and professional work. You'll be taught how to use object orientation and code-behind techniques to lay out your code clearly in a way other developers can easily understand. You'll learn how to query databases from within you web pages, spice up your layouts using ASP.NET AJAX and deploy your finished websites to production servers. You'll also learn how to debug your code when things go wrong and the performance and scalability issues that can affect your web projects as they grow. With you book you can take your first step towards becoming a successful ASP.NET developer with confidence.",
    "pageCount": 885,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=JalZGsmf9hwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": true,
    "saleInfoBuyLink": "https://play.google.com/store/books/details?id=JalZGsmf9hwC&rdid=book-JalZGsmf9hwC&rdot=1&source=gbs_api",
    "saleInfoListPriceAmount": 45.0,
    "saleInfoListPriceCurrencyCode": "USD"
  },
  {
    "title": "Beginning HTML5 and CSS3",
    "authors": [
      "Christopher Murphy",
      "Richard Clark",
      "Oli Studholme",
      "Divya Manian"
    ],
    "publisher": "Apress",
    "publishedDate": "2012-10-31",
    "description": "Beginning HTML5 and CSS3 is your introduction to the new features and elements of HTML5—all the leaner, cleaner, and more efficient code you’ve hoped for is available now with HTML5, along with some new tools that will allow you to create more meaningful and richer content. For everyone involved in web design, this book also introduces the new structural integrity and styling flexibility of CSS 3—which means better-looking pages and smarter content in your website projects. For all forward-looking web professionals who want to start enjoying and deploying the new HTML5 and CSS3 features right away, this book provides you with an in-depth look at the new capabilities—including audio and video—that are new to web standards. You’ll learn about the new HTML5 structural sections, plus HTML5 and CSS3 layouts. You’ll also discover why some people think HTML5 is going to be a Flash killer, when you see how to create transitions and animations with these new technologies. So get ahead in your web development through the practical, step-by-step approaches offered to you in Beginning HTML5 and CSS3. What you’ll learn Cutting-edge web development techniques with HTML5 and CSS3 The new features of HTML5 and how to work with HTML5 and CSS3 The new web standards being implemented by all the major web browsers How to work with the new HTML5 structural sections How to create HTML5 and CSS3 layouts How to create transitions and animations without using Flash New web typography solutions A new vision of web development with HTML5 and CSS3 Who this book is for This book is for web developers and anyone involved in web design who wants to embrace the new web standards and cutting-edge features of HTML5 and CSS3. With a practical, accessible approach, this book is for anyone who wants to push their websites forwards with the latest technologies.",
    "pageCount": 450,
    "categories": [
      "Computers"
    ],
    "averageRating": 5.0,
    "ratingsCount": 1,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=lP29IJbC6ooC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Pro PHP MVC",
    "authors": [
      "Chris Pitt"
    ],
    "publisher": "Apress",
    "publishedDate": "2012-10-31",
    "description": "Model View Controller (MVC) is becoming the definitive architecture of website development frameworks due to the stability, extensibility and predictability it lends to development. It is not just the primary separation of database, business logic and interface components, but includes a wide range of considerations for building high-performing, scalable and secure applications. Deciding which MVC framework best suits the project you are about to begin is one of the biggest challenges you'll face as a developer. If you are part of a team, this decision has probably already been made for you; but in any event, you'll need to know how (and why) the framework authors made it work the way it does. Pro PHP MVC looks at the building blocks that make any good MVC framework, and how they apply to PHP. It exposes all considerations that many developers take for granted when using a popular framework, and teaches you how to make the framework your own. Over the course of reading this book, you will learn the theoretical implications of the choices you would make when writing your own MVC framework, and how to put the pieces together in a cohesive package. We take a look at the highly modular Zend Framework—how to use its collection of loosely coupled classes to build a unified system. We also look at CakePHP, learning from its automated build system (Bakery) and highly intuitive approach to rapid development. This book will lay bare all the secret parts of MVC for you. What you’ll learn The best way to structure your application files How to get from a URL to the right controller/action Cleanly interact with data objects Efficient use of server resources in content delivery Useful shared class libraries to speed up development Unit testing to ensure maximum stability Who this book is for This book is for beginners and advanced developers alike, requiring a basic understanding of PHP5 language features and SQL. If you want to improve your PHP skills, or share the wisdom of popular PHP MVC frameworks, this book will be invaluable to you.",
    "pageCount": 500,
    "categories": [
      "Computers"
    ],
    "averageRating": 5.0,
    "ratingsCount": 1,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=lMs0bObg8bIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Pro WF 4.5",
    "authors": [
      "Bayer White"
    ],
    "publisher": "Apress",
    "publishedDate": "2012-11-14",
    "description": "In Pro WF 4.5, you'll find the insight and direction for understanding how to build workflows using WF 4.5 and host them as long-running services using Microsoft’s Windows Server, for on-premises work, and Azure AppFabric, for hosting workflows in the cloud. With the concept of cloud computing using Windows Azure and the maturity of Windows Server technology, workflow services can be hosted with first-class service monitoring with less overhead from a developer’s perspective. Building workflows in a declarative fashion, and hosting them as services, is a natural way for building business logic that is tiered away from running applications that subscribe to them, therefore providing flexibility for when business processes change. In Pro WF 4.5, author Bayer White walks you, as the developer, through the steps and explains the concepts of declaratively modeling domain specific business processes that can be hosted and exposed as services, either on premise or as cloud services within Windows Azure. Gives you a practical knowledge of WF 4.5, Windows Server and Azure AppFabric. Builds a foundation for building workflows that can be exposed on-premise or in the cloud. Shows how to use the tools available for managing workflow services. What you’ll learn Understand the changes introduced in Windows Workflow Foundation after WF 4.0 Build workflows by understanding what tools are available so they can be hosted as services Discover what hosting options are available with AppFabric and how to determine which one to use. Understand how to install and configure Windows Server and Windows Azure AppFabric. Deploy workflows as services using Windows Server and Windows Azure AppFabric. Determine current health of running services by understanding what tools are available for monitoring. Who this book is for Pro WF 4.5 is for developers and architects interested in building healthy long-running services either on-premise or in the cloud.",
    "pageCount": 750,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=z9Qsa-7ltTMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Learn Electronics with Arduino",
    "authors": [
      "Don Wilcher"
    ],
    "publisher": "Apress",
    "publishedDate": "2012-11-27",
    "description": "Have you ever wondered how electronic gadgets are created? Do you have an idea for a new proof-of-concept tech device or electronic toy but have no way of testing the feasibility of the device? Have you accumulated a junk box of electronic parts and are now wondering what to build? Learn Electronics with Arduino will answer these questions to discovering cool and innovative applications for new tech products using modification, reuse, and experimentation techniques. You'll learn electronics concepts while building cool and practical devices and gadgets based on the Arduino, an inexpensive and easy-to-program microcontroller board that is changing the way people think about home-brew tech innovation. Learn Electronics with Arduino uses the discovery method. Instead of starting with terminology and abstract concepts, You'll start by building prototypes with solderless breadboards, basic components, and scavenged electronic parts. Have some old blinky toys and gadgets lying around? Put them to work! You'll discover that there is no mystery behind how to design and build your own circuits, practical devices, cool gadgets, and electronic toys. As you're on the road to becoming an electronics guru, you'll build practical devices like a servo motor controller, and a robotic arm. You'll also learn how to make fun gadgets like a sound effects generator, a music box, and an electronic singing bird.",
    "pageCount": 280,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=NiFpaZFqzRsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": true,
    "saleInfoBuyLink": "https://play.google.com/store/books/details?id=NiFpaZFqzRsC&rdid=book-NiFpaZFqzRsC&rdot=1&source=gbs_api",
    "saleInfoListPriceAmount": 40.0,
    "saleInfoListPriceCurrencyCode": "USD"
  },
  {
    "title": "Pro WPF 4.5 in C#",
    "authors": [
      "Matthew MacDonald"
    ],
    "publisher": "Apress",
    "publishedDate": "2012-11-28",
    "description": "Microsoft's Windows Presentation Foundation (WPF) provides you with a development framework for building high-quality user experiences for the Windows operating system. It blends together rich content from a wide range of sources and allows you unparalleled access to the processing power of your Windows computer. Pro WPF 4.5 in C# provides a thorough, authoritative guide to how WPF really works. Packed with no-nonsense examples and practical advice you'll learn everything you need to know in order to use WPF in a professional setting. The book begins by building a firm foundation of elementary concepts, using your existing C# skills as a frame of reference, before moving on to discuss advanced concepts and demonstrate them in a hands-on way that emphasizes the time and effort savings that can be gained. What you’ll learn Understand the fundamentals of WPF programming from XAML to controls and data flow. Develop realistic application scenarios to see navigation, localization and deployment in action. Explore the advanced user interface controls that WPF provides. Learn to manage documents from within WPF: Text layout, printing, and document packaging are all covered. Use graphics and multimedia to add punch to your applications Who this book is for This book is designed for developers encountering WPF for the first time in their professional lives. A working knowledge of C# and the basic architecture of .NET is helpful to follow the examples easily, but all concepts will be explained from the ground up.",
    "pageCount": 850,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=znAVMHNSen0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "BizTalk 2010 EDI for Health Care",
    "authors": [
      "Mark Beckner"
    ],
    "publisher": "Apress",
    "publishedDate": "2013-01-06",
    "description": "Building a successful health care claims processing EDI implementation in BizTalk Server can be complex. Decisions must be made around how to extract and publish data, how to map to the 837 EDI standard, and how to appropriately batch and deliver data. If architected properly, your BizTalk solution can be highly efficient, simple, and something that can be managed and extended for years to come. The topics in this book include building complete inbound and outbound solutions for 837 Institutional and Professional EDI document types. In addition, topics around 997/999 acknowledgements and related document types are included. Covering mapping, trading partner configuration, AS2, SFTP, data extraction, data routing, and batching, you will find this to be a goldmine of information to aid you in a successful implementation. What you’ll learn 1. Successfully create HIPAA compliant 837 Professional implementations 2. Build fully operational inbound and outbound processes using AS2, SFTP, and FTP 3. Integrate with SQL Server, .NET Libraries, and other platforms and technologies 4. Develop maps, schemas, orchestrations and configure encrypted file delivery 5. Configure batching of documents for various scenarios Who this book is for BizTalk 2010 Developers, technical architects, and executives of Health Care Companies looking to implement BizTalk or EDI, BizTalk 2010 Table of Contents 1. Architectural Patterns 2. Solution: Receiving 837P Data 3. Solution: Sending 837P Data 4. Mapping Data 5. Ports, AS2, and Acknowledgements",
    "pageCount": 96,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=Q-H-3WEIiEsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Pro Django",
    "authors": [
      "Marty Alchin"
    ],
    "publisher": "Apress",
    "publishedDate": "2013-08-23",
    "description": "Learn how to leverage Django, the leading Python web application development framework, to its full potential in this advanced tutorial and reference. Updated for Django 1.5 and Python 3, Pro Django, Second Edition examines in great detail the complex problems that Python web application developers can face and how to solve them. It provides in–depth information about advanced tools and techniques available in every Django installation, running the gamut from the theory of Django’s internal operations to actual code that solves real–world problems for high–volume environments. Pro Django, Second Edition goes above and beyond other books, leaving the basics far behind and showing how Django can do things even its core developers never expected. By drawing on the dynamic nature of Python, you can write Django applications that stretch the limits of what you thought possible!",
    "pageCount": 300,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=WVEQAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": true,
    "saleInfoBuyLink": "https://play.google.com/store/books/details?id=WVEQAAAAQBAJ&rdid=book-WVEQAAAAQBAJ&rdot=1&source=gbs_api",
    "saleInfoListPriceAmount": 40.0,
    "saleInfoListPriceCurrencyCode": "USD"
  },
  {
    "title": "Pro AngularJS",
    "authors": [
      "Adam Freeman"
    ],
    "publisher": "Apress",
    "publishedDate": "2014-03-31",
    "description": "AngularJS is the leading framework for building dynamic JavaScript applications that take advantage of the capabilities of modern browsers and devices. AngularJS, which is maintained by Google, brings the power of the Model-View-Controller (MVC) pattern to the client, providing the foundation for complex and rich web apps. It allows you to build applications that are smaller, faster, and with a lighter resource footprint than ever before. Best-selling author Adam Freeman explains how to get the most from AngularJS. He begins by describing the MVC pattern and the many benefits that can be gained from separating your logic and presentation code. He then shows how you can use AngularJS's features within in your projects to produce professional-quality results. Starting from the nuts-and-bolts and building up to the most advanced and sophisticated features AngularJS is carefully unwrapped, going in-depth to give you the knowledge you need. Each topic is covered clearly and concisely and is packed with the details you need to learn to be truly effective. The most important features are given a no-nonsense in-depth treatment and chapters include common problems and details of how to avoid them.",
    "pageCount": 688,
    "categories": [
      "Computers"
    ],
    "averageRating": 5.0,
    "ratingsCount": 1,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=n5mJAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": true,
    "saleInfoBuyLink": "https://play.google.com/store/books/details?id=n5mJAwAAQBAJ&rdid=book-n5mJAwAAQBAJ&rdot=1&source=gbs_api",
    "saleInfoListPriceAmount": 10.0,
    "saleInfoListPriceCurrencyCode": "USD"
  },
  {
    "title": "PHP for Absolute Beginners",
    "authors": [
      "Jason Lengstorf",
      "Thomas Blom Hansen"
    ],
    "publisher": "Apress",
    "publishedDate": "2014-08-07",
    "description": "PHP is a server-side scripting language that enables you to develop dynamic sites that engage users in ways that are simply not possible using only HTML and CSS. PHP for Absolute Beginners takes a practical approach to teaching you how to build dynamic content for your website using PHP. You’ll quickly get started with practical PHP projects, learning how to build a dynamic image gallery. By the end of the book you’ll will have developed a personal blog complete with a password protected admin module. PHP for Absolute Beginners won't swamp you with every detail of the full PHP language up front – instead, you’ll be introduced to a small, versatile subset of PHP and learn to use it creatively to develop dynamic web sites. In the process you will learn to use variables, control structures, functions, and objects to your advantage. You will learn how to plan and create databases and how to organize your PHP scripts beautifully. At the end of the book, you will be a confident PHP user, ready to take the next steps in creating great websites.",
    "pageCount": 256,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=vhM7BAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": true,
    "saleInfoBuyLink": "https://play.google.com/store/books/details?id=vhM7BAAAQBAJ&rdid=book-vhM7BAAAQBAJ&rdot=1&source=gbs_api",
    "saleInfoListPriceAmount": 30.0,
    "saleInfoListPriceCurrencyCode": "USD"
  },
  {
    "title": "Pro Python",
    "authors": [
      "Marty Alchin",
      "J. Burton Browning"
    ],
    "publisher": "Apress",
    "publishedDate": "2014-12-22",
    "description": "You’ve learned the basics of Python, but how do you take your skills to the next stage? Even if you know enough to be productive, there are a number of features that can take you to the next level in Python. Pro Python, Second Edition explores concepts and features normally left to experimentation, allowing you to be even more productive and creative. In addition to pure code concerns, Pro Python develops your programming techniques and approaches, which will help make you a better Python programmer. This book will improve not only your code but also your understanding and interaction with the many established Python communities. This book takes your Python knowledge and coding skills to the next level. It shows you how to write clean, innovative code that will be respected by your peers. With this book, make your code do more with introspection and meta-programming. And learn and later use the nuts and bolts of an application, tier-by-tier as a complex case study along the way. For more information, including a link to the source code referenced in the book, please visit http://propython.com/.",
    "pageCount": 384,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=3VgnCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": true,
    "saleInfoBuyLink": "https://play.google.com/store/books/details?id=3VgnCgAAQBAJ&rdid=book-3VgnCgAAQBAJ&rdot=1&source=gbs_api",
    "saleInfoListPriceAmount": 40.0,
    "saleInfoListPriceCurrencyCode": "USD"
  },
  {
    "title": "Beginning Django Cms",
    "authors": [
      "Nigel George"
    ],
    "publisher": "Apress",
    "publishedDate": "2015",
    "pageCount": 175,
    "categories": [
      "Django (Electronic resource)"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=jKxPCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Beginning Scala",
    "authors": [
      "Vishal Layka",
      "David Pollak"
    ],
    "publisher": "Apress",
    "publishedDate": "2015-03-03",
    "description": "Beginning Scala, Second Edition takes a down-to-earth approach to teaching Scala that leads you through simple examples that can be combined to build complex, scalable systems and applications. This book introduces you to the Scala programming language, its object-oriented and functional programming characteristics, and then guides you through Scala constructs and libraries that allow you to assemble small components into high-performance, scalable systems. You will learn why Scala is judiciously used for critical business applications by leading companies such as Twitter, LinkedIn, Foursquare, the Guardian, Morgan Stanley, Credit Suisse, UBS, and HSBC. Scala is a multi-paradigm programming language that combines both functional and object-oriented features. Moreover, this highly scalable language lends itself well to building cloud-based/deliverable Software as a Service (SaaS) online applications.",
    "pageCount": 260,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=zOQYCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": true,
    "saleInfoBuyLink": "https://play.google.com/store/books/details?id=zOQYCAAAQBAJ&rdid=book-zOQYCAAAQBAJ&rdot=1&source=gbs_api",
    "saleInfoListPriceAmount": 40.0,
    "saleInfoListPriceCurrencyCode": "USD"
  },
  {
    "title": "Pro REST API Development with Node.js",
    "authors": [
      "Fernando Doglio"
    ],
    "publisher": "Apress",
    "publishedDate": "2015-05-26",
    "description": "Pro REST API Development with Node.js is your guide to managing and understanding the full capabilities of successful REST development. API design is a hot topic in the programming world, but not many resources exist for developers to really understand how you can leverage the advantages. This book will provide a brief background on REST and the tools it provides (well known and not so well known). Understand how there is more to REST than just JSON and URLs. You will then cover and compare the maintained modules currently available in the npm community, including Express, Restify, Vatican, and Swagger. Finally you will code an example API from start to finish, using a subset of the tools covered. The Node community is currently flooded with modules; some of them are published once and never updated again - cluttering the entire universe of packages. Pro REST API Development with Node.js shines light into that black hole of modules for the developers trying to create an API. Understand REST API development with Node.js using this book today.",
    "pageCount": 196,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=kjUwCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": true,
    "saleInfoBuyLink": "https://play.google.com/store/books/details?id=kjUwCgAAQBAJ&rdid=book-kjUwCgAAQBAJ&rdot=1&source=gbs_api",
    "saleInfoListPriceAmount": 35.0,
    "saleInfoListPriceCurrencyCode": "USD"
  },
  {
    "title": "Dashboards for Excel",
    "authors": [
      "Jordan Goldmeier",
      "Purnachandra Duggirala"
    ],
    "publisher": "Apress",
    "publishedDate": "2015-06-24",
    "description": "Dashboards for Excel is your key to creating informative, actionable, and interactive dashboards that will have your managers singing your praises. The book takes a hands-on approach to developing dashboards, from instructing users on advanced Excel techniques to addressing dashboard pitfalls common in the real world. Throughout the book, the reader is challenged to think about Excel and data analytics differently—that is, to think outside the cell. This book will show you how to create dashboards in Excel quickly and effectively. Don’t wait—get started today. Covers advanced Excel techniques mixing formulas and Visual Basic for Applications (VBA) to create interactive dashboards Shows how dynamic charts and tables can be used to create dashboards that are constantly up-to-date and providing fresh information. Demonstrates how to display important data summaries, analytics, and visualization all in the same Excel window! Builds on a firm foundation of industry best practices and the author’s hard won real-world experience What you’ll learn Learn the visualization tools, charts, tables, and graphs important to management. Understand what management doesn’t want to see in a report Turn around dashboards faster and cheaper than ever before Understand the key role dashboards play in an organization Analyze real-world dashboards to apply important features to your own organization Utilize understated, but powerful, Excel formulas and VBA code Avoid common pitfalls in Excel development and dashboard creation Who this book is for This book is for many people. It’s for the developer who isn’t satisfied by accepting Excel’s so-called limitations, who feels that with some creativity, spreadsheets can become a powerful and informative decision engine. It’s for the Excel user who has spent hours—even outside of work—experimenting with Excel formulas and macros in an attempt to find a better, more efficient way to complete a task. It’s for the user who believes in the power of the spreadsheet.",
    "pageCount": 750,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "imageLinksThumbnail": "http://books.google.com/books/content?id=26PllgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  },
  {
    "title": "Pro Hortonworks Data Platform",
    "authors": [
      "Stephen Giles"
    ],
    "publisher": "aPress",
    "publishedDate": "2015-12",
    "description": "Companies are finding new sources of valuable data--from social media to clickstreams to server logs to machine and geolocation data--and they know they need to employ big data tools, like Hadoop, to make the best use of it. Many organizations are turning to Hortonworks--started by twenty-four of the original team of Yahoo! engineers that developed Hadoop--a company that has emerged as one of the key vendors helping enterprise customers make use of Hadoop to gain new, powerful insights into customer needs and wants. The company's flagship product, Hortonworks Data Platform (HDP), is more than a product. It is a platform and a suite of tools that together create a framework for loading, managing, accessing and analyzing massive volumes of data no matter the format or schema. Pro Hortonworks Data Platform: Harness the Power and Promise of Big Data with HDP, written by Hadoop and HDP expert Stephen Giles, is designed to help readers gain full advantage from HDP. The book--which assumes no prior knowledge of Hadoop--provides an understanding of all facets of HDP and how the various parts work both together and within a larger data platform. It is the insightful \"missing manual\" that all HDP users need to understand the platform in depth and how to use it to best advantage. Pro Hortonworks Data Platform provides a deep understanding of the specific components that make HDP so powerful. The book will: Show how to install, configure, and secure HDP and all its components Illustrate the full lifecycle of a big data project using HDP Provide a deep understanding of Yarn, the core engine of Hadoop Show how to leverage HDP/Apache tools like Pig, Hive, Hbase, and Solr to harness data Pro Hortonworks Data Platform provides insight and hands-on examples of how to work with each tool within the Hortonworks framework. Developers and IT pros will be able to get an understanding of Hadoop and its supporting tools, as well as a clear sense of where and when to take advantage of its power. This book will not only show you how to process data effectively--it will show you how to take advantage of the business opportunities that lie within that data.",
    "pageCount": 400,
    "categories": [
      "Computers"
    ],
    "averageRating": 0.0,
    "ratingsCount": 0,
    "saleInfoCountry": "GB",
    "saleInfoForSale": false
  }
]